[{"id":"de-DE","data":{"5211821108101006086":"Januar|Februar|März|April|Mai|Juni|Juli|August|September|Oktober|November|Dezember","5561679194207360621":"Jan|Feb|Mär|Apr|Mai|Jun|Jul|Aug|Sep|Okt|Nov|Dez","4347495245017203437":"Montag|Dienstag|Mittwoch|Donnerstag|Freitag|Samstag|Sonntag","7889684886225557283":"Mo|Di|Mi|Do|Fr|Sa|So","1932602193071186690":"Bis heute|Bis gestern|Bis Wochenende","5834168600078458550":"Zeitraum festlegen","2310647568592664311":"Der Zeitraum enthält keine auswertbaren Tage","5037437391296624618":"Information","8720977247725652816":"Ok","9175670018185396326":"Fehler","2883646110198626293":"Debug Meldung","8702309441108344248":"Bestätigung","5982204146953564471":"Nein","8807722618432376624":"Ja","4609106925336303462":"Heute","5904041394389170462":"Letzte 2 Tage","3753908710962332501":"Letzte 3 Tage","4552894200644449843":"Letzte Woche","8819199067642626219":"Letzte 2 Wochen","101470742938506804":"Letzte 3 Wochen","2000702703315269520":"Letzter Monat","1070566507761088905":"Letzte 3 Monate","7441923818926073330":"Erstes Quartal","2017499472136539166":"Zweites Quartal","5487195230082733790":"Drittes Quartal","2711034407981793742":"Viertes Quartal","3217863696400545387":"Die angegebene URL ist nicht erreichbar. Wenn die URL stimmt, dann kann es an den Nightscout-Einstellungen liegen. ","2312689462569807321":"<br><br>Wenn diese URL geschützt ist, muss ausserdem der Zugriffsschlüssel korrekt definiert sein. Diesen erreicht man über \"Administrator-Werkzeuge\" auf der persönlichen Nightscout Seite.","2383228502926115665":"In der Variable ENABLE muss das Wort \"cors\" stehen, damit externe Tools wie dieses hier auf die Daten zugreifen dürfen.","6595412903016005597":"Auf 10be muss beim Server in den Standardeinstellungen der Haken bei \"cors\" aktiviert werden, damit externe Tools wie dieses hier auf die Daten zugreifen dürfen. Wenn \"cors\" aktiviert wurde, muss auf dem Server eventuell noch ReDeploy gemacht werden, bevor es wirklich verfügbar ist.","781258887519852436":"Die Url zur Nightscout-API muss mit https beginnen, da Nightscout Reporter auch auf https läuft. Ein Zugriff auf unsichere http-Resourcen ist nicht möglich.","2794107815134152683":"Ausgewählter Zeitraum","9159519588031360427":"Einen Monat vorher","6747117754964396439":"Drei Monate vorher","6456973552694094312":"Sechs Monate vorher","2253731368282111375":"Ein Jahr vorher","6702640511673365425":"Keine Daten","4657328650853061238":"Gerade eben","8653385405278371687":"vor {$PH} Minute","2487173854002315363":"vor {$PH} Minuten","8321702175940480370":"dd.MM.yyyy","9092306029835436845":"dd.MM.","3313528406596871463":"Deutsch","1971933864247059812":"English (USA)","6987083569809053351":"English (GB)","7535527225967694107":"Español","1064234756083312933":"Polski","7937242121546466365":"日本の","6534020895863932691":"Slovenský","4134147244760971282":"Français","4540642178875789338":"Português","5136294278847788019":"Dansk","6992563145654706141":"Automatisch","3333116154946080626":"Standard","4642296428675275889":"Weihnachten","7053165526253804483":"mg/dL","366054145027712910":"mmol/L","194409124541441735":"Beide","5243913849166444349":"Einheit der Glukosemessung","5911839073246333860":"Unbegrenzt","9090867213238754343":"Es gab keine Antwort innerhalb von {$PH} Sekunden bei {$PH_1}","7716816989054584047":"Beim Auslesen der Profile ist ein Fehler aufgetreten. Möglicherweise sind zu viele Daten in der Profiltabelle (wird z.B. von iOS Loop verursacht).\nDu kannst versuchen, in den Einstellungen die Anzahl an auszulesenden Profildatensätzen zu verringern.","5517254381877899996":"Lade die Basisdaten...","623955052110859995":"Bitte einen Zeitraum wählen.","1212886905101328952":"Max Mustermann","4703731356564184326":"Bereite Daten vor...","8912953969714276103":"Es konnten nicht alle Profile geladen werden, da im ausgewählten Zeitraum mehr als {$PH} gespeichert sind. ","3802873172037186880":"Der Uploader \"{$PH}\" hat die Datensätze angelegt.","7979899145647988883":"Folgende Uploader haben die Datensätze angelegt: {$PH}","3927439908064576549":"Lade Daten für {$PH}...","3336682057311020015":"status","3117299459475029064":"Erzeuge PDF...","1634398240503205507":"Fehler beim Laden der Daten","3402864355211188521":"PDF anzeigen","6530668891861059555":"Fehler beim Laden der Daten:{$PH}{$PH_1}","5863317744980308324":"Die URL wurde noch nicht festgelegt","6942991069579974059":"vor {$PH}:{$PH_1} Std","1655600906414706904":"in {$PH}:{$PH_1} Std","7474325248670696284":"vor {$PH} Min","8323150325400475247":"in {$PH} Min","3874345800986431846":"dd.MM.yyyy, hh:mm","7623135239551445678":"Datenschutzerklärung","5370131778638173602":"tl;dr","5947911019810079011":" Diese Webseite speichert keine Daten auf Servern. Die benötigten Daten werden von der eingegebenen URL zur Nightscout-Instanz geholt und als PDF aufbereitet. Die Daten, die zur Funktion der Webseite benötigt werden, werden im localStorage des Browsers gespeichert und nicht an den Server übermittelt. Wenn die Synchronisierung mit Google Drive aktiviert wird, dann werden diese Daten zusätzlich in den Anwendungsdaten auf dem Google Drive des verbundenen Kontos gespeichert. ","6499248921022013171":"Mehr gibt es dazu eigentlich nicht zu sagen.","5373738532021944062":" Da wir seit einiger Zeit in Europa eine DSGVO haben, werden im Folgenden noch die Vorschriften dafür erfüllt. Der folgende Text ist nur auf Deutsch verfügbar: ","1547876271716599756":"Impressum","9006470127040087838":"Menü","7884965915711326781":"Shortcuts","2919577367673059766":"Willkommen","4013713004189700793":"Facebook Seite","4435703504669117699":"Einstellungen","6747831291037730611":"Zur Listenansicht","8791014723871344124":"Zur Kachelansicht","1974187181485501471":"Google Assistant","3884532559361891104":"Was bisher geschah...","8960233799181110623":"Nightscout Seite","5528370461881275549":"Nightscout Berichte","3650664205119216637":"Night-Watch","623302995999546215":"Hinzufügen","238096398375218127":"Ausgabe Parameter","775186130891581459":"Allgemeines","4411190801473304003":" zu Vergleichszwecken (z.B. Arzt) ","3976173699076358131":"Maximaler Glukosewert in Grafiken","3462597418071398844":"Genauigkeit der Basalangaben:","2164615386567002229":"PDF im selben Fenster öffnen ","4327350523859337871":" PDF herunterladen (bei einigen Browsern benötigt) ","1791432405259233812":" Hinweise auf Nightscout in der Kopf- und Fusszeile des PDFs ausblenden ","3207807959521883818":" Loopdaten verbergen (die auf diese Art markierten Optionen ignorieren) ","1370605287118453829":" Nightscout Url in der Fusszeile des PDFs anzeigen ","6696796687707268309":" Korrektur für Datenänderungen in AAPS 3.0 ","7829526216105920315":"Historische Daten","1162043530117522910":" Hiermit wird festgelegt, um wieviel der Zeitraum des PDFs verschoben werden soll, um Vergleichswerte zu erhalten. ","7488980554242426848":"PDF erzeugen","283025994311758119":"Aus den Profilen ermitteln","7503778474761741054":"Automatisch","1598746595773064259":"Neuester Tag zuerst","3659593449749302548":"CGP immer mit Standard Zielbereich","1278432863271212107":"Standard Zielbereich verwenden ({$PH}{$PH_1} - {$PH_2}{$PH_3})","5477028811151651395":"Spenden","4662145775420138869":"{$START_TAG_MAT_ICON}settings{$CLOSE_TAG_MAT_ICON} Einstellungen ","2282062055953871612":"Benutzerdaten","8249756895437311001":"Geburtstag","8211692273508098341":"Diabetes seit","3396314321097880980":"Anzeigeeinstellungen","129650423662878645":" Auf Kacheln Bilder statt Namen anzeigen ","2545616070433977010":"Zusatzfunktionen","4624774365035265039":" Letzten Messwert in der Titelzeile anzeigen ","2800404845518989039":" Dieser Regler legt fest, wie gross eine Ausgabe maximal werden darf, bevor sie auf mehrere PDF-Dateien aufgeteilt wird. Wenn bei Erstellung eines PDFs ein leeres Fenster angezeigt wird, dann hilft es normalerweise, diesen Regler weiter nach links zu bewegen. ","6619828374701727023":"Klein","3612295001678001579":"Gross","2981827022225347256":" Einstellungen von Release-Version übernehmen ","1554339525671560484":"Exportieren","7079158434111612488":"Importieren","2854123663314832793":"Speichern","7316802260023787780":"Url zur Nightscout-API (z.B. https://xxx.herokuapp.com)","8953033926734869941":"Name","3908184019891735429":"Insulin","7251442440878885611":"Zugriffsschlüssel","3171615835928522212":"Daten von","4391891567115525191":"Daten bis","4265956136039965395":"Ermittle ersten Tag mit Daten","8753888603691598520":"Ermittle letzten Tag mit Daten","4562561451144140468":"Die Profiltabelle sollte normalerweise nur Daten zu den verwendeten\n  Profilen beinhalten. iOS Loop verwendet diese Tabelle aber dazu, um dort eigene Einstellungen zu speichern\n  und tut dies bei einigen Benutzern exzessiv. Ab einer bestimmten Datenmenge kann die Profiltabelle über\n  die API dann nicht mehr korrekt abgefragt werden. Deswegen gibt es hier die Möglichkeit, die Anzahl an\n  Datensätzen einzuschränken, die aus dieser Tabelle geholt werden. Das ist so lange notwendig, wie\n  iOS Loop oder andere Uploader diese Tabelle falsch befüllen.<br><br>Maximale Anzahl an Profildatensätzen:","msgAccessTokenHint":"Der Zugriffsschlüssel wird nur benötigt, wenn der Zugriff in Nightscout über AUTH_DEFAULT_ROLES eingeschränkt wurde","msgStartDateHint":"Das Datum des ersten Tages mit Daten","msgEndDateHint":"Das Datum des letzten kompletten Tages mit Daten","msgCalculatingDay":"Überprüfe {$PH} ...","msgCheckUser":"Überprüfe Zugriff auf {$PH}...","252203167182468471":"Soll der Benutzer {$PH} wirklich gelöscht werden?","6976047278355685385":"Soll die URL {$PH} vom Benutzer wirklich gelöscht werden?","6173747547691801544":"Umbruch","8952127940350080207":"Glukose","1555082262291746678":"Faktor","3414879184931145630":"Glukose (aus NS)","7897216764489223339":"Uhrzeit","8377516972708378852":"Zeit","2442939966015776692":"Trendpfeil","4586989554085646197":"Benutzer","935267939147271845":"Datum","56228327617948862":"Einheit","4333733863543260974":"Leer","8259238864102475814":"Skala","5928437581414846354":"Night-Watch","902339008106012146":"Willkommen bei Nightscout Reporter!","5012810716920776309":" Diese Seite dient der Erzeugung von PDF-Dokumenten mit den bei Nightscout gespeicherten Daten. Dafür ist es notwendig, auf diese Daten zugreifen zu können, weshalb zunächst ein paar Einstellungen gespeichert werden müssen. Solange diese nicht vorhanden und gültig sind, kann die Seite nichts für Dich tun. ","3623177105972637781":" Die Daten, die Du hier eingibst, werden normalerweise im localStorage des Browsers gespeichert. Dieser beinhaltet webseitenbezogene Daten, die nur von dieser Webseite ausgelesen werden können. In diesem Fall werden keine Cookies verwendet und es werden keine Daten auf Servern gespeichert. Es wird lediglich eine Verbindung zur angegebenen Nightscout-Instanz aufgebaut und die dort vorhandenen Daten ausgelesen, um daraus ein PDF-Dokument zu erzeugen. Dieses kann dann dem Diabetesberater oder sonstigen Interessenten vorgelegt werden. ","2360508661070570624":" Wenn in den Einstellungen eine Verbindung zum Google-Konto hergestellt wird, werden die Cookies von Google verwendet und die Daten zusätzlich im AppStorage auf Google Drive gespeichert. Auf diese Art kann man die Daten zentralisiert verwalten und hat diese in jedem Browser zur Verfügung, der mit dem angegebenen Google Konto verbunden ist. ","8528225876938473795":" Die Webseite verwendet Javascript zur Erledigung ihrer Aufgaben. ","2544369118898450507":" Einstellungen für die Verwendung der Seite vornehmen ","2528934711548921086":" Einstiegsvideo ","2400857379190014720":" Impressum ","5056019409968123182":" Datenschutzerklärung ","2724055831234181057":"Version","6531665188528193744":"4.0.0 - xx.xx.2022","7690963465911786727":" In Night-Watch kann man nun einen Nachtmodus aktivieren, in dem der Hintergrund schwarz ist und die Farben des Textes den aktuellen Wert bezüglich des Zielbereichs darstellen. ","4415729321899251066":"3.0.2 - 22.09.2022","852241593925968958":" In Night-Watch gibt es nun die Möglichkeit, die Einstellungen aufzurufen, wenn man den Editor aktiviert hat. ","3730862028149929162":"3.0.1 - 26.08.2022","1555329174638511589":" Die Einstellung für die Anpassung von BG_TARGET_BOTTOM und BG_TARGET_TOP ist nun unabhängig von der Auswahl \"Glucosewerte anpassen\". Damit kann man die Option umschalten, ohne den Zielbereich auf dem Server neu konfigurieren zu müssen. ","2070423548703697974":" Night-Watch zeigt nun auch Werte an, wenn diese von mehreren Uploadern innerhalb kurzer Zeit mehrfach in Nightscout gespeichert wurden. Das sollte man zwar möglichst vermeiden, aber nun kann Night-Watch auch damit umgehen. ","4401243026654727453":"3.0.0 - 21.08.2022","4027913842661346247":" Eine neue Ansicht namens {$START_ITALIC_TEXT}Night-Watch{$CLOSE_ITALIC_TEXT} wurde hinzugefügt. In dieser Ansicht sieht man, so wie auch in der Uhr-Anzeige auf der Nightscout-Seite, den aktuellen Glukosewert und weitere Informationen, die man sich in gewissem Rahmen so konfigurieren kann, wie sie einem gefallen. Night-Watch wird über diese URL aufgerufen: {$START_LINK} https://nightscout-reporter.zreptil.de/watch {$CLOSE_LINK} Es kann auch über das Hauptmenü unter dem Menüpunkt {$START_ITALIC_TEXT}Night-Watch{$CLOSE_ITALIC_TEXT} aufgerufen werden, oder indem man den aktuellen Zuckerwert in der Titelleiste von Nightscout Reporter anklickt, wenn man diesen in den Einstellungen aktiviert hat. ","5736239371712783896":" Die Konfiguration erfolgt direkt im Fenster von Night-Watch, indem man etwas anklickt. Dadurch wechselt die Seite in den Editiermodus und mit den Controls am unteren Rand des Fensters können die vorhandenen Elemente verändert, verschoben, gelöscht oder neue Elemente hinzugefügt werden. Mit dem Speichern-Icon in den Controls werden die Einstellungen gespeichert und der Editiermodus beendet. Er kann auch beendet werden, indem man das aktive Element anklickt, wobei dann die Änderungen aber nicht gespeichert werden. Nach dem Neuladen der Seite hat man dann die letzte Ansicht vor sich. ","1050317483122628114":" Wenn Night-Watch beim Aufruf feststellt, dass noch keine Konfiguration vorgenommen wurde, dann kann man über das altbekannte Settingsfenster seine Einstellungen vornehmen. Das kommt vor, wenn man die Seite als WebApp installiert, da dort der Browserspeicher, in dem die Konfiguration gehalten wird, normalerweise noch nicht befüllt wurde. ","5947493486939609850":" Dort, wo ein CGP erstellt werden kann, gibt es nun die Option {$START_ITALIC_TEXT}Linien um Bereiche{$CLOSE_ITALIC_TEXT}. Diese ist standardmässig eingeschaltet. Wenn sie ausgeschaltet wird, werden die Wertebereiche für den gesunden und den aktuellen Menschen nicht mehr mit einer Linie umrandet. Damit sieht die Grafik etwas blasser aus, aber man kann die Werte auf den Achsen genauer untersuchen, wenn man das möchte. ","8360132556674484241":" Die Anpassung der Glukosewerte wird nun bei den Einstellungen gespeichert. Sie kann aber weiterhin bei den Ausgabeparametern geändert werden, um ohne grosse Umwege einen Vergleich erstellen zu können. ","3002649473456271492":" Die Anzeige des Faktors auf dem PDF, wenn ein Korrekturfaktor eingestellt wurde, wurde in eine Prozentangabe geändert um welche die Zuckerwerte erhöht oder verringert wurden. ","5161800057808633917":" Bei der letzten Version sind Änderungen in den Code eingeflossen, die nicht wirklich durchdacht waren. Dafür entschuldige ich mich. Ich habe diese wieder entfernt, damit Nightscout Reporter für alle Benutzer die gewohnte Funktionalität bietet. ","3878679546622250583":"2.2.2 - 10.08.2022","2790002888153650104":" Die Glukosewerte können nun mit einem Faktor korrigiert werden, der sich aus dem im Labor ermittelten und errechneten HbA1C Wert ergibt. Dieser Faktor betrifft alle Sensorwerte, die in Nightscout Reporter verarbeitet werden. Der Faktor wird in den Ausgabeparametern festgelegt. Dort wird er über die Checkbox \"Glukosewerte anpassen\" aktiviert und deaktiviert. Wenn er aktiviert ist, erscheinen zwei Schieberegler. Der obere legt den errechneten HbA1C fest, der untere den im Labor ermittelten HbA1C. Wenn er aktiviert ist, wird auf jedem PDF rechts oben angegeben, mit welchem Faktor die Glukosewerte korrigiert wurden. Das hat auf jedem PDF Auswirkungen auf dem Glukosewerte verarbeitet werden. ","4147318213814334750":"2.2.1 - 01.05.2022","1769909291323572792":" Der Wert für die mittlere Glukose bei gesunden Menschen im CGM wurde auf die korrekten 90 mg/dl korrigiert. ","2879661645028294680":"2.2.0 - 03.03.2022","1532752124480011601":" Wenn in Nightscout die Daten für die täglich erzielten Schritte vorhanden sind, dann werden diese in der Tagesgrafik angezeigt, wenn dort die Option \"Bewegung anzeigen\" aktiviert ist. ","762123312118417977":"2.1.0 - 09.12.2021","1870892084810980626":" In den Optionen zur Tagesgrafik gibt es jetzt die Möglichkeit, den oberen Wert für die Kohlenhydrate festzulegen. Das kann bei hohen COB-Werten die Skalierung verbessern. ","4422706624977497553":"2.0.12 - 07.12.2021","5806530923856567958":" In AAPS 3.0 wird ändert sich einiges an den Datenstrukturen und Datenmengen, die gespeichert werrden. Das verursacht in Nightscout Reporter an einigen Stellen Probleme, die sich nicht generell lösen lassen, Deswegen gibt es jetzt bei den Ausgabe Parametern die Option \"Korrektur für Datenänderungen in AAPS 3.0\", mit der bei Erstellung der PDFs bestimmte Probleme korrigiert werden. Diese Änderungen werden hier mit FixAAPS30 markiert. ","8393381918629325198":" FixAAPS30: Die Erstellung der PDFs kann extrem lange dauern. Das liegt an einer Flut von Profil-Switches, die durch ein Plugin für die Automatisierung erstellt werden. Das verursacht einen Profil-Switch alle 4 Minuten mit Speicherung des kompletten Profils. Wenn die Option aktiv ist, dann werden diese Profil-Switches aussortiert und ermöglichen dadurch die Erstellung des PDFs. Diese Profil-Switches sind dann in den PDFs nicht mehr sichtbar. ","7591237650730122137":"2.0.11 - 26.11.2021","2751104959635245741":" Es ist in der Kachelansicht jetzt möglich, Formulare zu duplizieren, um verschiedene Ansichten des gleichen Formulars auf einmal zu erzeugen. Dazu gibt es rechts unten auf den Kacheln ein Kopier-Icon. Wenn dieses ausgelöst wird, dann wird das aktuelle Formular kopiert und als neue Kachel hinter der aktuellen Kachel eingefügt. Diese kann dann genauso behandelt werden, wie jede andere Kachel. Auf dieser neuen Kachel gibt es rechts unten ein Mülleimer-Icon. Wenn dieses ausgelöst wird, dann wird die Kachel wieder entfernt. Von einem Formular können maximal 2 Kopien erstellt werden. Die Optionen der Formulare werden ebenso wie die Reihenfolge wie bisher auch gespeichert. Die kopierten Kacheln bleiben also erhalten. In der Listenansicht tauchen die kopierten Formulare auch auf. Allerdings gibt es dort nicht die Möglichkeit, sie zu kopieren oder zu löschen. Das muss in der Kachelansicht erfolgen. ","6745578137559489120":" In den Formularen Profil und Basalrate gibt es eine neue Option \"Profil 'NR Profil' verwenden\". Normalerweise wird das zu verwendende Profil automatisch anhand des angegebenen Zeitraums ermittelt. Hiermit kann das unterbunden werden und ein Profil mit dem Namen \"NR Profil\" wird gesucht. Wenn dieses gefunden wird, dann wird das ausgegeben. Wenn es nicht gefunden wird, wird ein Text ausgegeben, der erklärt, wo man das einstellen kann. ","4744302988537687434":"2.0.10 - 07.11.2021","8872022155836002913":" In der Tabelle im Glukose Perzentil Diagramm kann man nun zwei neue Spalten ausgeben lassen. Diese beinhalten die durchschnittlichen Kohlenhydrate und Insulineinheiten. ","1288949110572989112":" In den Optionen von Formularen, in denen man Spalten ein- und ausblenden kann, wird nun angezeigt, wieviele Spalten noch verfügbar sind. ","2129586481684638035":" Die Farben für die Glukosebereiche werden jetzt dort, wo sie als Hintergrundfarbe mit Text verwendet werden heller dargestellt, um die Lesbarkeit zu erhöhen. ","5004382605526127776":"2.0.9 - 11.08.2021","3126436268119900262":" In der Tagesgrafik kann man nun die temporären Overrides von iLoop auch anzeigen lassen. Es wird der Grund angezeigt. Für genauere Informationen kann das so wie bisher auch im Protokoll angezeigt werden. ","3641087201992938885":" Das Projekt wurde auf Dart 2.13.4 und Angular 6.0.1 aktualisiert. ","6108433000631385298":" Grenzwerte wurden nicht durchgängig gleich behandelt. Jetzt sollte die Zuordnung der Werte zu den Zielbereichen im gesamten Programm identisch sein. ","7710513321247749321":"2.0.8 - 09.06.2021","7775437439433173719":" Es gibt ein neues Formular namens \"Verteilung der Glucosewerte\". Das zeigt die prozentuale Verteilung der Glukosewerte für den ausgewählen Zeitraum an. ","6226802260373705016":" In der Tagesstatistik werden nun in der Summenzeile die Durchschnittswerte für einige Werte zusätzlich angezeigt. ","7210409618317942818":"2.0.7 - 17.04.2021","8564681797670707729":" Bei der Festlegung des Zeitraums kann man jetzt angeben, bis zu welchem Tag der Zeitraum ermittelt werden soll. Voreingestellt ist so wie bisher auch der aktuelle Tag. Man kann aber auch den gestrigen Tag einstellen, um Tage mit vollständigen Daten zu haben, oder das letzte Wochenende, wenn man an vollständigen Wochen interessiert ist. ","367303512291797081":" Dialoge und die Anzeige des Fortschritts werden nun technisch etwas anders umgesetzt. Deswegen wird der Anwendungshintergrund nun in den Fällen dunkler dargestellt und es ist nicht möglich darauf etwas anzuklicken. ","7340603650425734708":" Ein Fehler wurde behoben, der dazu führte, dass Dialoge mit Escape geschlossen werden konnten, was die Anwendung in einem unbrauchbaren Zustand zurückliess. ","5905727688073027582":" Ein Fehler wurde behoben, der bei der Auswahl des Zeitraums die Benutzung verhinderte, wenn man ein leeres Eingabefeld fokussierte. ","6190617408362038063":" Ein Fehler wurde behoben, der dafür sorgte, dass die Anwendung in einem undefinierten Zustand war, wenn man den letzten Benutzer gelöscht hat. ","5363903869059504921":" Die falsche Bezeichnung für durchschnittliche Kohlenhydrate pro Tag in der Tagesstatistik wurde durch die korrekte Bezeichnung für durchschnittliche Kohlenhydrate pro Mahlzeit ersetzt. ","8334086213032649583":" Die Ausgabe des Zielwertes und der blutigen Werte in der Tagesgrafik wurde korrigiert. Da gab es Probleme, wenn man eine andere Blutzucker Einheit als die auf dem Server eingestellte zur Ausgabe verwendet hat. ","180382405131627291":"2.0.6 - 17.03.2021","5719790065377190370":" Nachdem ich immer wieder gefragt wurde, ob man mir eine Spende zukommen lassen kann, habe ich mich jetzt dann doch dazu entschlossen, so eine Möglichkeit zur Verfügung zu stellen. Nightscout Reporter ist aber nach wie vor komplett kostenlos und wird das auch bleiben. Wer dennoch seiner Zuneigung zum Programm Ausdruck verleihen will, dem will ich mich nicht länger in den Weg stellen. Der Spenden-Button ist nicht sichtbar. Aber wer etwas in den {$START_BOLD_TEXT}Hut{$CLOSE_BOLD_TEXT} werfen will, der wird ihn finden :) ","8107955527265901582":" Das Logo von Nightscout Reporter wurde geändert. Es ist nach wie vor die bekannte und beliebte Eule, aber sie hat nun eine Mütze auf wie die Zeitungsausträger und teilweise auch Journalisten in uralten Filmen. Das Logo ist nur im Programm vorhanden und erscheint nicht auf den PDFs. Dort ist nach wie vor das normale Nightscout Logo, weil es dort platziert wurde, um auf Nightscout selbst hinzuweisen. ","3486776005303008081":" Ein Fehler bei der Ausgabe der temporären Ziele in der Tagesgrafik wurde behoben. ","5617009498669034752":"2.0.5 - 07.03.2021","249203943265379320":" In der Tagesstatistik können nun Spalten für TDD und Kohlenhydrate angezeigt werden. ","9077822308483882893":" Die URLs der Benutzer werden nun nach dem Enddatum sortiert. ","1648006290762345134":" Der Titel vom Glucose Percentil Diagramm wird nun auch bei Ausdruck im Hochformat nicht mehr falsch in den Optionen Formularauswahl dargestellt. ","4618253937871330245":"2.0.4 - 18.02.2021","4662473426829266826":" Es gibt eine neue Option in der Tagesgrafik mit der man den Zielwert ein- und ausblenden kann. ","3973581189074376000":" Ein Fehler wurde behoben, der dazu führte, dass bei fehlenden Daten wie z.B. Treatments gar kein PDF mehr erstellt werden konnte. ","3733027323071468938":"2.0.3 - 18.10.2020","4189163313360250386":" In den Ausgabeparametern gibt es eine Checkbox, mit der man dafür sorgen kann, dass alle Optionen, die auf einen Loop hinweisen würden, für diese Ausgabe deaktiviert werden. Das sind die Optionen, die mit einem Kreis (=Loop) markiert sind. ","1385194978895103036":" Beim erstmaligen Start von Nightscout Reporter wurde er schon bei Sprachänderung normal angezeigt. Jetzt bleibt er wie vorgesehen auf dem Willkommen Dialog. ","2015943630007503660":" Die Anzeige der Bilder auf Kacheln wird nun wie vorgesehen korrekt in den Einstellungen vorbelegt. ","8998504045959494100":"2.0.2 - 22.9.2020","2368803697644471999":" Es gibt jetzt kleine Hilfebuttons bei den Formularen. In der Listenansicht ersetzen sie die Icons zum Ziehen der Formulare, in der Kachelansicht werden sie links oben auf den Kacheln dargestellt. Die jeweilige Ansicht kann man im Hamburgermenü auswählen. Beim Anklicken eines solchen Buttons wird ein Text angezeigt, der beschreibt, was das entsprechende Formular darstellt. ","4801150433240118911":" Bei den Ausgabeparametern kann jetzt festgelegt werden, in welcher Einheit die Glukosemessungen ausgegeben werden sollen. Diese wird zu Beginn aus den in Nightscout gespeicherten Daten ermittelt und entsprechend vorbelegt. Es ist aber auch möglich, diese Einheit zu ändern oder beide Einheiten ausgeben zu lassen. Wenn beide ausgegeben werden, dann wird jedes Formular auf dem Glukoseangaben vorhanden sind zunächst mit mg/dL und danach nochmal mit mmol/l ausgegeben. Diese Einheit wird auch in den Shortcuts gespeichert. ","5363146551438448686":" Die Profilbasalrate im Formular Tagesprofil wird jetzt ebenfalls mit Balken dargestellt. ","8986914645891772545":" iOS Loop missbraucht die Profiltabelle dazu, seine eigenen Settings zu speichern, was bei Benutzern dieser Software dazu führte, dass die Tabelle Profil nicht korrekt geladen werden kann. Deshalb gibt es jetzt in den Einstellungen die Möglichkeit, die Anzahl der Datensätze, die aus der Profiltabelle geladen werden einzuschränken. ","6497985202106625626":"2.0.1 - 8.9.2020","7546949084135718483":" Im Protokoll werden nun auch temporäre Overrides ausgegeben, die von iOSLoop in die Behandlungsdaten eingetragen werden. ","551024001500537626":" Im Tagesprofil kann nun angegeben werden, ob nur der Wert, die prozentuale Anpassung des Profils oder beides angezeigt werden soll. Ausserdem kann eine Linie eingefügt werden, die den im Basalprofil zum jeweiligen Zeitpunkt eingestellten Wert darstellt. ","776628642357054674":" In der Tagesgrafik werden Profilwechsel nicht mehr angezeigt, wenn sich das Profil beim Wechsel nicht geändert hat. iOSLoop fügt in die Nightscoutdatensätze sehr häufig neue Profile ein, die keine Änderung beinhalten, weil dort zusätzlich andere Konfigurationseinstellungen gespeichert werden. ","6403133731909788820":" Ein Fehler beim Laden der ausgewählten Formulare wurde korrigiert. ","2058680923660828079":" Wenn die Synchronisierung mit Google Drive aufgehoben wird, wird die Berechtigung nun korrekt zurückgesetzt. Wenn man sich danach wieder synchronisieren will, werden nochmal die Berechtigungen abgefragt. ","3088655788723001856":" Ein Fehler wurde behoben, der dafür sorgte, dass temporäre Ziele in der Tagesgrafik mit zeitlicher Verschiebung angezeigt wurden. ","8625201307861730443":"2.0.0 - 15.7.2020","254350099574435930":" Auf der Seite Protokoll werden jetzt auch Insulinabgaben angezeigt, die z.B. über xdrip eingegeben wurden. ","6668542709116248568":" Es gibt jetzt Shortcuts, mit denen man die aktuelle Auswahl der Formulare, deren Parameter und den ausgewählten Zeitraum speichern kann. Beim Aktivieren eines Shortcuts wird das alles wieder so eingestellt, wie es war, als der Shortcut gespeichert wurde. ","1212576341097901577":" Bei Herokuapp und anderen Anbietern kostenloser Datenbankinstanzen ist der Speicherplatz der Instanz beschränkt, weshalb sie irgendwann voll ist. Dann kann man zwar eine neue Instanz anlegen, Nightscout Reporter benötigt aber für eine lückenlose Darstellung aller Tage Zugriff auf alle Instanzen, für die man eine Auswertung erhalten will. Deshalb können nun mehrere URLs für die Nightscout Instanzen eingegeben werden. Zusätzlich muss noch eingegeben werden, welches der erste und der letzte Tag mit Daten ist. Mit diesen Informationen ist es Nightscout Reporter dann möglich die benötigten Daten lückenlos auch über mehrere Instanzen hinweg auszuwerten. ","5995258864673211674":" Wenn im CGP ein Wert den Maximalwert der Skala überschreitet, wird die entsprechende Ecke mit einem gelben Kreis markiert. ","4859852917369166314":" Auf dem Einstellungen-Dialog gibt es neben den URL-Eingabefeldern jeweils einen Button, um die URL in einem neuen Browser-Fenster zu öffnen. ","3447517096322897919":" Die Eingabe des Zugriffsschlüssels auf dem Einstellungen-Dialog kann jetzt mit einem Button neben dem Eingabefeld lesbar gemacht werden. ","1711733399034110313":" Im Einstellungen Dialog gibt es jetzt die Möglichkeit, die Einstellungen zu exportieren und zu importieren. Beim Export wird eine Datei mit den allgemeinen Einstellungen geschrieben, beim Import wird so eine Datei wieder eingelesen. Damit kann man auch ohne Google Drive Zugriff die Einstellungen über verschiedene Browser hinweg manuell synchronisieren. ","8856258134513163384":" Im Protokoll gibt es jetzt die Möglichkeit, sich doppelte Datensätze markieren zu lassen. Sie werden von Nightscout Reporter zwar rausgefiltert, aber er kann anzeigen, wie oft ein bestimmter Datensatz in den Daten gefunden wurde. Man kann dort auch angeben, dass er nur mehrfach vorhandene Datensätze ausgeben soll. So kann man mögliche Diskrepanzen zwischen Nightscout Reporter und anderen Reporting Tools herausfinden. ","9205635258616208737":" Das CGP wird jetzt auch bei extremen Werten korrekt erzeugt. ","6153436125529965415":" Im CGP wurden die Skalenbeschriftungen korrigiert. ","3000176393513028893":"1.4.9 - 16.6.2020","1943421202531989250":" Im Dialog der Ausgabe Parameter gibt es nun die Möglichkeit, das CGP immer mit dem Standard Zielbereich zu erzeugen. Diese Option ist anfangs eingeschaltet, da das CGP ein standardisiertes Formular ist, das gerne zu Vergleichszwecken herangezogen wird. Man kann es aber für seine eigenen Zwecke ausschalten. Diese Einstellung wird dann auch beibehalten. ","4323473302664976561":" Bei der Profilermittlung wurde manchmal der letzte Profilwechsel ignoriert. Das ist nun behoben. ","7323937542234729848":"1.4.8 - 12.6.2020","2472629482396530303":" Im Dialog der Ausgabe Parameter wurde rechts oben der Schieberegler \"zu Vergleichszwecken\" hinzugefügt. Wenn dieser aktiviert ist, dann wird überall der Standard Zielbereich verwendet. Intern wird das auch noch für andere Anpassungen verwendet. Diese Option ist dafür gedacht, dass man seine Ausdrucke mit anderen Diabetikern vergleichen kann. Das ist zum Beispiel zur Vorlage bei Ärzten und Diabetesberatern sinnvoll. ","1521724811274823666":"1.4.7 - 5.6.2020","178167591864512183":" In den Ausgabe Parametern kann nun angegeben werden, ob immer der neueste Tag zuerst angezeigt wird. Das hat Auswirkungen auf die Tagesgrafik, die Tagesstatistik und die Wochengrafik. In den Formularoptionen wurde die entsprechende Option entfernt. ","4069609562496327381":" Die Einstellung für das Öffnen des PDF im gleichen Fenster, das Herunterladen des PDFs und den Hinweis auf Nightscout im PDF wurde aus den Einstellungen in die Ausgabe Parameter verschoben. Dadurch kann man das bei jedem Ausdruck schnell festlegen und ändern. ","1889463294004142043":" Die Überschrift über der Tabelle vom Glucose Perzentil Diagramm wurde korrigiert. ","935167882152248287":"1.4.6 - 26.5.2020","1859396878177985943":" Die Legende der Tagesgrafik wurde um den Eintrag für blutige Messungen erweitert. ","6952979771734977277":" Die Microboli vom Minimed 600 Uploader wurden aus der Ausgabe entfernt, da es sich dabei nur um Temporäre Basalraten handelt. ","646288099630857269":" Ein möglicher Absturz bei der Ausgabe des CGP bei der Tagesgrafik wurde korrigiert. ","6148136580809379915":"1.4.5 - 20.4.2020","1457203540861930912":" In dem Dialog mit den Ausgabe Parametern wurde die Option hinzugefügt, die Genauigkeit der Ausgabe von Basalangaben festzulegen. Diese wird normalerweise aus den Angaben zur Basalrate in den Profilen ermittelt. Das wird auch weiterhin getan, wenn der erste Eintrag in der Liste ausgewählt wird. Ansonsten werden alle Basalangaben mit der Genauigkeit ausgegeben, die bei dieser Option ausgewählt wurde. ","8264241065914297074":" Die Genauigkeit der ISF Angaben im Profil wurde korrigiert. ","3527586935053740660":" Im Protokoll werden die Angaben, die ein temporäres Ziel von 0 IE für 0 Minuten setzen als \"Aufhebung von temp. Ziel\" ausgegeben. ","1244966041592586421":" Im CGP wurden verschiedene Berechnungen korrigiert, die sich vor allem in Differenzen bei ToR und Mittelwerten zeigten. ","2222665376864452296":"1.4.4 - 6.4.2020","5927508921047157494":" Die Legende der Tagesgrafik wurde um den Eintrag für Bewegung erweitert. ","8235016752586028422":" In der Tagesgrafik wurde \"Training\" in \"Bewegung\" umbenannt. Das passt besser zu den Einträgen in AAPS. ","8561248196119572242":" Die Farbe für Bewegung in der Tagesgrafik wurde geändert. ","5687739014441416493":"1.4.3 - 26.3.2020","2821808669677263348":" Die Analysewerte wurden nicht ganz korrekt ermittelt. Das wurde korrigiert und nun sollten die statistischen Daten über den Zeitraum richtig ausgewertet werden. ","4805198381346712324":"1.4.2 - 16.3.2020","5860943879159140968":" Beim Laden der Behandlungsdaten werden doppelte Datensätze herausgefiltert. ","5144857777940134247":" Die berechneten IE für Kohlenhydrate in der Tagesgrafik wurden teilweise mit falschen Faktoren ermittelt. Der Fehler wurde behoben. ","5144536262616789382":"1.4.1 - 13.3.2020","578951855176091443":" Beim Perzentil Diagramm gibt es eine neue Option, mit der man die Basalrate unter dem Diagramm anzeigen lassen kann. Da das Diagramm normalerweise einen grösseren Zeitraum umspannt, wird dort die Basalrate angezeigt, die zu Beginn des Zeitraums aktiv war. ","5043358342819391308":" Fehler behoben, der bei der Kachelansicht teilweise verhindert hat, dass die Parameter für die Kacheln aufgerufen werden konnten. ","2409272712772684143":"1.4 - 28.2.2020","2520143539437399731":" Es gibt ein neues PDF namens Tagestrend. Dieses zeigt die Werte eines Tages zusammen mit dem Trend zu jeder vollen Stunde, sowie der eingestellten Basalrate aus dem Profil. Das ist eine gute Übersicht für Basalratentests, um zu erkennen, wo etwas anzupassen ist. ","2375241106938069440":" In der Tagesgrafik gibt es eine neue Option, um die Rundung der Insulinwerte auf die maximale Genauigkeit im Profil zu unterbinden. Das macht da Sinn, wo entweder kein Profil vorhanden ist, oder wo Werte mit höherer Genauigkeit als im Profil eingegeben werden. ","6702430398101655097":" In der Tagesgrafik kann man nun die IOB (Insulin On Board) und COB (Carbs On Board) anzeigen lassen. Die IOB werden am oberen Rand angezeigt, wo auch die Bolusabgaben dargestellt werden, die COB am unteren Rand, wo auch die Kohlenhydrate dargestellt werden. ","1651519445898465212":" Nightscout Reporter kann nun auch auf Portugiesisch verwendet werden. ","1008274726311390907":" Es gibt ein neues PDF namens Tagesstunden. Dieses zeigt die Durchschnittswerte eines Tages in jedem Stundenintervall an und färbt die Zellen entsprechend des Glukosewertes ein. So hat man eine gut Übersicht über die Werteverteilung im ausgewählten Zeitraum. ","7104630496375913610":" Beim Glukose Perzentil Diagramm kann man nun ein Maximum für die Skalierung festlegen. Wenn es auf \"Automatisch\" gesetzt wird, wird das Maximum wie bisher auch ermittelt. Bei einem anderen Wert wird die Obergrenze für das Diagramm auf diesen Wert festgesetzt. Damit ist es leichter möglich zwei Diagramme miteinander zu vergleichen, deren Obergrenze unterschiedlich ist. ","8375454931910189110":" Vor der Erzeugung eines PDFs wird noch ein Dialog angezeigt, auf dem man Parameter für alle erzeugten PDFs eingeben kann. Man kann dort den Zielbereich auf den Standardbereich festlegen, den Ärzte gerne sehen. Das hat Auswirkungen auf alle Darstellungen des Zielbereichs, sowie auf die Verteilung der Werte innerhalb und ausserhalb des Zielbereichs. Man kann dort auch den Maximalwert für Glukose in Grafiken festlegen. Dieser Wert wird in der Tagesgrafik, dem Perzentil Diagramm und der Wochengrafik verwendet. Wenn er auf \"Automatisch\" gesetzt wird, wird der Maximalwert wie bisher auch aus den vorhandenen Daten ermittelt. Ausserdem kann man hier angeben, ob man den aktuellen Zeitraum erzeugen möchte oder einen Vergleichszeitraum. Das ist nützlich, um dem Arzt die Gegenüberstellung von Werten der Vergangenheit und jetzt zu zeigen. ","5288956970564382460":" Die Buttons für die Erzeugung vergangener Zeiträume wurden entfernt. Das kann jetzt im neuen PDF-Dialog eingestellt werden. ","6173496910859711125":" Wenn auf der Profilseite leere Spalten vorkommen, führt das nicht mehr zu einer leeren Seite. ","219984260763911802":" Die Werte VarK und ToR im CGP werden bei Tages- und Wochengrafiken in der Legende und in der Grafik korrekt ausgegeben. ","2852591961759458780":"1.3.8 - 9.1.2020","1809235701722508795":" Die Bilder auf den Kacheln sind nun in der jeweiligen Sprache beschriftet. ","4397306327955789552":" Die Werte im CGP werden jetzt bei mmol-Angaben auch korrekt angezeigt. ","4560018245994990811":" Die glykämische Variabilität wird jetzt im CGP auch bei Tages- und Wochengrafiken korrekt ausgegeben. ","4654989694327732254":" Blutige Werte sollten jetzt auch bei mmol-Daten korrekt in der Tagesgrafik angezeigt werden. ","6979472472852367048":"1.3.7 - 7.1.2020","2302435151120933638":" Auf der Seite \"Stündliche Statistik\" gibt es eine neue Option, um auch Spalten mit 10% und 90% anzeigen zu lassen. ","4183107641349593655":" Auf der Seite \"Profil\" wird die Gültigkeit jetzt mit Uhrzeit angezeigt. ","2351955831263495533":" Die Einträge im Protokoll für temporäre Ziele werden jetzt auch bei mmol-Angaben richtig angezeigt. ","4371971384726011702":" Die Überschrift über der mittleren Spalte im Tagesprofil wurde korrigiert. ","344285122296548980":" Die Balken in der Analyse werden jetzt korrekt skaliert. ","7529089406957892656":" Die meisten Spalten auf der Seite \"Stündliche Statistik\" werden bei nicht vorhandenen Daten leer gelassen. ","3149727159507769753":"1.3.6 - 18.12.2019","4338020822976744494":" In der Tagesgrafik gibt es die Option, HTML-Notizen zu unterdrücken. Manche Uploader schreiben in die Notizen komplette HTML-Seiten rein, was im PDF extrem schlecht darstellbar ist. Deswegen kann man diese mit Setzen der Option ausblenden. ","1486315394846247998":" Die Glucose Perzentil Grafik wurde um die Tabelle \"Stündliche Statistik\" erweitert. Diese listet tabellarisch die Werte des Zeitraums für jede Stunde des Tages auf. Man kann entweder nur die Grafik, nur die Tabelle oder beides zusammen erzeugen lassen. ","4296089440581191975":" In der Sprachauswahl ist jetzt auch Slowakisch verfügbar. ","5917099675353120492":" Es gibt eine neue PDF-Seite für die Tagesprofile. Darauf ist eine Tabelle zu sehen, die die tatsächliche Basalrate für den Tag zeigt, inklusive aller temporären Anpassungen. Ich brauchte das für Debugzwecke, aber vielleicht findet das der eine oder andere Benutzer auch interessant. Das Profil, das dort angezeigt wird entspricht dem Tagesprofil auf der Seite Tagesgrafik. Beim Loopen können das sehr viele Seiten werden, da dort normalerweise alle paar Minuten Anpassungen an der Basalrate vorgenommen werden. Deswegen wird die Tabelle auch abhängig von der Datenmenge in maximal drei Spalten dargestellt, um die Anzahl an Seiten zu reduzieren. ","1157175530873408256":" In der Tagesgrafik werden nun auch verzögerte Boli angezeigt. ","5992158705594270344":" In der Tagesgrafik kann nun angezeigt werden, wie lange die Basalrate auf 0% lief. ","5608198084809920921":" Die Oberfläche kann jetzt verschiedene Darstellungen annehmen. Diese zeigen sich zur Zeit durch geänderte Farben und ein angepasstes Icon im Browsertab und beim Laden der Seite. Das hat keine Auswirkungen auf die erzeugten PDF-Dateien. Es ist die Vorbereitung für eine teilweise anpassbare Oberfläche. Das Thema der Darstellung wird standardmässig vom System festgelegt, was zur Zeit heisst, dass im Dezember ein weihnachtliches Thema angezeigt wird. Das kann aber durch Anklicken des Icons, das ab jetzt links unten zu sehen ist, geändert werden. Beim Anklicken wird rechts neben dem Icon ein Bereich mit den verfügbaren Darstellungen eingeblendet. Das erste Icon (der kleine Zauberer) bedeutet dabei, dass die Darstellung vom System ermittelt wird. Zur Zeit bedeutet das die weihnachtliche Darstellung im Dezember. Es kann in Zukunft aber auch weitere Kriterien geben, anhand derer das Thema angepasst wird. Die direkte Festlegung eines Themas mit einem der anderen icons hat aber immer Vorrang vor der systemeigenen Logik. ","3888140531601603940":" Bei der Basalrate und dem Profil gibt es nun eine Option jeweils nur das letzte im entsprechenden Zeitraum ausgeben zu lassen. Das verringert die Blätterflut bei häufigem Profilwechsel. ","2024681007626528818":" Bei der Auswertung kann nun ein Bereich angezeigt werden, in dem die Anzahl an Unterzuckerungen während des ausgewählten Zeitraums und der Zeitpunkt der letzten Unterzuckerung angezeigt werden. ","1035689884230136345":" Im Einstellungsdialog wurden die Zeilen mit den Benutzerangaben und der URL gegeneinander ausgetauscht, um eine sinnvollere Verwaltung zu ermöglichen. ","1641271819822982368":" Die Seitenzahlen auf den Kacheln wurden weiter an den unteren Rand verschoben, damit sie immer gut lesbar sind. ","344506395878755771":" Die Profile für den Zeitraum wurden teilweise nicht korrekt identifiziert. Das sollte behoben sein. ","2030029299779748010":" Die Ermittlung der effektiven täglichen Basalrate wurde umstrukturiert und sollte nun genauere Werte ergeben. ","4325695290778507968":" Der Fehler mit der Vervielfachung der Kohlenhydrate bei wiederholter Ausgabe der PDFs wurde korrigiert. ","1569989707425310522":" Das Problem, dass bestimmte Tage nicht erzeugt werden konnten, wurde behoben. ","5699262807402577465":"1.3.5 - 23.09.2019","3638886361385276435":" Ein Fehler in der Zahlenformatierung wurde behoben. ","2065332686732298551":" Die temporäre Basalrate am Anfang des Tages wurde bisher falsch gesetzt, wenn sie im vorherigen Tag gesetzt wurde. Das wurde behoben. ","7275012469320266123":"1.3.4 - 17.09.2019","949068715944509998":" Im Protokoll können jetzt auch Batteriewechsel der Pumpe angezeigt werden. ","458883639069462613":" Die einzelne Seite CGP kann jetzt auch im Querformat ausgegeben werden. ","228516987941010013":" Die Aufsummierung der Werte in der Analyse wurde korrigiert. ","2649096380678409429":"1.3.3 - 12.09.2019","1374861392086238047":" In der Kachelansicht können die Parameter aller ausgewählten Seiten zusammen in einer Liste eingestellt werden. Dazu gibt es im Titelbereich der Parameterliste neben dem Schliessen-Button einen zusätzlichen Button, mit dem man zwischen den beiden Möglichkeiten umschalten kann. ","6987738548003965177":" Die Einstellungen für das Herunterladen des PDFs, das Öffnen im gleichen Fenster und die Maximalgrösse der PDFs wurden von der Synchronisierung mit Google Drive ausgenommen, weil sie speziell für den verwendeten Browser oder das verwendete Gerät benötigt werden. Sie werden nach wie vor gespeichert, aber sie werden nicht zwischen verschiedenen Browsern synchronisiert. ","3323452754604557042":" Die Vorschaubilder auf den Kacheln passen sich abhängig von den ausgewählten Optionen teilweise an (z.B. die Auswahl von CGP bei Tagesgrafiken). ","2690640691353907541":"1.3.2 - 05.09.2019","637973906878144864":" Beim CGP werden die aktuellen Werte jetzt in der Legende angezeigt. ","8324624518437788500":" Es ist jetzt möglich, die Einstellungen auf Google Drive zu speichern. Das hat den Vorteil, dass man die Einstellungen nicht nur im aktuellen Browser hat, sondern bei jedem Browser, mit dem man sich bei Google anmeldet. Die Einstellungen werden nach wie vor im Browser gespeichert. Bei einer Verbindung zu Google Drive werden sie aber zusätzlich auf Google Drive gespeichert. Beim Laden der Seite wird überprüft, ob eine Synchronisierung gewünscht ist. Wenn das der Fall ist, dann werden die Daten von Google Drive heruntergeladen. Wenn die Daten darin neuer sind als die Daten im Browser, werden sie verwendet. Nach dem Speichern der Daten werden bei aktivierter Synchronisierung diese Daten mit dem aktuellen Zeitstempel auf Google Drive gespeichert. Die Synchronisierung wird im Menü auf der linken Seite aktiviert und deaktiviert. Sie kann auch beim erstmaligen Aufruf der Seite in einem neuen Browser direkt im Willkommensbildschirm aktiviert werden. Nightscout Reporter verlangt nur die Berechtigung die eigenen App-Daten zu speichern und zu laden und benötigt keinen Zugriff auf andere Daten auf Google Drive. ","1537316464073239080":" In der Tagesgrafik kann jetzt bei Auswahl der Tages Basalrate angegeben werden, dass der Name des Profils angezeigt wird, das am Beginn des Tages aktiv war. Dieser wird dann so angezeigt, wie ein Profilwechsel um 0 Uhr. ","4133750409032285515":" Auf den Kacheln können nun Bilder statt der Namen angezeigt werden. Die Bilder zeigen dann das ungefähre Aussehen der entsprechenden Seite an. Sie entsprechen nicht den tatsächlichen Daten, sondern sind nur eine visuelle Darstellung, die es manchem Benutzer vielleicht einfacher machen, die gewünschten Seiten schneller auszuwählen. Die Aktivierung der Bilder erfolgt im Einstellungsdialog. ","6779869517946618634":" In der Tagesstatistik wurden bei unvollständigen Daten teilweise fehlerhafte Werte ausgegeben. Das wurde korrigiert. ","3232250136745312561":"1.3.1 - 22.08.2019","4206805838472246561":" Auf den Seiten Profil und Basalrate wird in der Titelzeile jetzt wieder das Datum angezeigt, ab dem das Profil gilt. ","4422467851321563280":" Die Listenansicht ist jetzt wieder scrollbar. ","3643845729189557867":" Temporäre Profilwechsel werden jetzt erkannt und in der Tagesgrafik korrekt angezeigt. ","5341698289441155949":"1.3.0 - 19.08.2019","8146468687629465400":" Das \"Comprehensive Glucose Pentagon\" (Umfassendes Glukose Fünfeck) wurde als eigenes PDF und als Zusatzseite zur Tagesgrafik und Wochengrafik hinzugefügt. Es handelt sich hierbei um eine Darstellung von fünf Messgrössen, mit deren Hilfe sich die Qualität der Therapie ermitteln und mit anderen vergleichen lässt. Auf den Ausdrucken wird ein Verweis auf die zugrunde liegende Abhandlung ausgegeben. ","5473742690313153149":" In der Tagesgrafik gibt es eine Option, die berechneten IE für aufgenommene Kohlenhydrate anzeigen zu lassen. Der Wert, der unmittelbar unter den Kohlenhydraten angezeigt wird, entspricht dem Bolus, der zu diesem Zeitpunkt für diese Kohlenhydratmenge abgegeben werden sollte. Dieser Wert kann niedriger als der tatsächlich abgegebene Wert ausfallen, weil für die Insulinabgabe noch IOB und andere Faktoren berücksichtigt werden. ","8975705877195107130":" In der Tagesgrafik werden nun auch bei Anzeige des Zielwertes die temporären Ziele berücksichtigt. ","7961594264824963560":" In der Auswertung gibt es eine neue Option, um den Standardbereich feiner abzustufen. Dort werden dann zusätzlich sehr hohe Werte und sehr niedrige Werte angezeigt. ","1214528572829489975":" Nightscout Reporter kann nun auch in Japanisch verwendet werden. ","6500412548922445683":" Es ist jetzt möglich, die Buttons zur PDF-Auswahl als Kacheln darstellen zu lassen. Die Option dazu ist im Menü auf der linken Seite zu finden. In der Kachelansicht werden die Buttons über die verfügbare Fläche verteilt und sind so auf kleinen Geräten leichter zu treffen. Ausserdem sieht man dann normalerweise alle verfügbaren PDFs auf einen Blick und muss nicht scrollen. Auf den aktivierten Kacheln wird angezeigt, an welcher Stelle im PDF die entsprechenden Seiten ausgegeben werden und wieviele Seiten die entsprechende Kachel ausgibt. Diese Zahl kann für die meisten Kacheln korrekt ermittelt werden, bei einigen ist das aber ohne Auswertung der Daten nicht möglich (z.B. Profile und Protokoll). In diesem Fall wird entweder keine Seitenzahl oder eine Mindestzahl an Seiten angegeben. Sobald die Erstellung des PDFs erfolgt ist, werden die korrekten Zahlen angezeigt. Die Reihenfolge der Kacheln kann verändert werden, indem man sie festhält und an die Stelle verschiebt, an der man sie gerne hätte. Nach Anklicken des Icons in der oberen rechten Ecke können die Parameter für das entsprechende PDF erfasst werden. ","7160940962425267941":" Im Profil werden nun die Gesamtsumme der Basalrate und die durchschnittlichen Werte für ICR und ISF pro Stunde angezeigt. ","4695217704774528427":" Optionen für die PDFs, die eine eindeutige Beziehung zu einem laufenden Loop haben, werden nun in Blau dargestellt. Das vereinfacht es, PDFs zu erstellen, denen man nicht ohne Weiteres entnehmen kann, dass ein Loop vorliegt. Dazu müssen nur die Haken bei den blauen Optionen entfernt werden. ","1014059318041581677":" Die Basalratenprofile für den Tag werden nun auch anhand der Behandlungsdaten ermittelt. Profilwechsel werden in der Tagesgrafik angezeigt und sollten ab dem Zeitpunkt des Wechsels auch eine korrekte Basalratenanpassung anzeigen. ","7942425111070005991":" Die Seiten Profil und Basalrate zeigen nun bei einem Profil, das nur temporär während eines Tages aktiv war den Zeitraum an, in dem es aktiv war. ","9184436701168902285":" Die Buttons für die vergangenen Perioden werden nicht angezeigt, wenn kein Zeitraum oder kein PDF ausgewählt wurde. ","4268264579661177316":" Einige der Optionen für die PDFs wurden hierarchisch angeordnet. Es macht z.B. keinen Sinn, die SMB Werte in der Tagesgrafik an der Kurve platzieren zu lassen, wenn die SMB Werte gar nicht angezeigt werden. Deswegen werden Optionen, die von einer anderen Option abhängen nur dann angezeigt, wenn die entsprechende Option markiert ist. Dadurch ändert sich leider auch die Speicherung der Optionen, weshalb sich die aktuelle Auswahl der Optionen bei manchen PDFs verändert. Da müssen die Optionen dann neu gesetzt werden. ","2157030766827342548":" Die Auswahl des Zeitraums und der Benutzer wurde in die Titelzeile verschoben. ","1815971569776610202":" Die Ermittlung der Einheit (mg/dl oder mmol/l) wird nun flexibler gehandhabt, so dass auch Leerzeichen in der entsprechenden Einstellung nicht mehr zu einer Fehlinterpretation führen. ","5632679110845292760":" Ein Fehler wurde behoben, der in der Tagesgrafik dazu führte, dass Texte in der Legende andere Texte überschrieben haben. ","712859232306955242":" Die Berechnung der PDF-Grössen wurde korrigiert, so dass nun weniger PDFs erstellt werden, wenn sie aufgrund der Grösse aufgeteilt werden. ","6857274831409329221":" Zur Berechnung der Analyse, Tagesstatistik und Tagesgrafik wird nun die gleiche Datenbasis verwendet, so dass die Werte auf allen PDFs gleich sind. ","8409005361355205198":" Es werden jetzt auch blutige Werte erkannt, die von Loop auf dem IPhone eingetragen werden. ","3683057152176636379":"1.2.11 - 17.05.2019","2654047377927903318":" Es gibt jetzt die Möglichkeit, PDFs vergangener Zeiträume zu erzeugen, ohne den Zeitraum anpassen zu müssen. Oberhalb des Buttons zur PDF-Erzeugung gibt es zwei Buttons, welche die PDFs für eine frühere Periode erzeugen. Der untere der beiden Buttons erzeugt die Vorperiode, der obere die vorletzte Periode. Auf den Buttons wird das Startdatum und das Enddatum angezeigt. Wenn z.B. als Zeitraum \"Letzte 2 Wochen\" gewählt wurde, dann wird mit dem unteren Button der Zeitraum von zwei Wochen beginnend vor vier Wochen erzeugt und mit dem oberen Button der Zeitraum von zwei Wochen beginnend vor sechs Wochen. Auf diese Art kann man recht einfach Vergleichsberichte erzeugen, um die Entwicklung der Werte zu erkennen. Auf den Seiten wird für diese Ausdrucke in der Kopfzeile das Wort \"Historisch 1\", bzw. \"Historisch 2\" oberhalb des Zeitraums ausgegeben. So kann man beim Vergleich der Werte die Daten voneinander unterscheiden. ","4254345544296939544":" Die teilweise falsch zugewiesenen Grenzwerte für die Bereiche (niedrig, normal, hoch) wurden korrigiert. ","3107503169734290104":"1.2.10 - 18.04.2019","7593372333861890400":" Auf der Profilseite wurde die Spalte für die Werte von ICR verbreitert. ","8979739944203859295":" In der Tagesgrafik werden die Insulinangaben jetzt kleiner dargestellt, wenn die Basalrate eine Genauigkeit von mehr als 2 Nachkommastellen hat. ","5979934076766905336":" Die mittlerweile überflüssige Option zur Darstellung der Basalrate mit zwei Nachkommastellen wurde aus der Tagesgrafik entfernt. ","1323675827997337022":"1.2.9 - 15.04.2019","1760128920365351301":" Ein Link zur Facebookseite von Nightscout Reporter wurde im Menü hinzugefügt. ","4401082481560828706":" Die Mischung von zwei Seiten auf einer PDF-Seite, die manchmal vorkam, wurde behoben. ","6074987269166266204":"1.2.8 - 11.04.2019","7283909761894961461":" Es gibt in den Einstellungen eine neue Option, um den letzten in Nightscout gespeicherten Glukosewert in der Titelzeile anzeigen zu lassen. Wenn diese Option aktiviert ist, wird der aktuelle Wert, das Alter des Wertes, der Trendpfeil und die Differenz zum vorherigen Wert rechts in der Titelzeile angezeigt. Diese Anzeige wird jede Minute aktualisiert, solange das Browserfenster den Eingabefokus besitzt. Wenn es diesen nicht hat, wird die Aktualisierung angehalten und der Wert ausgeblendet, um nicht unnötig Systemresourcen zu belasten. ","6127082239864610996":" In der Tagesgrafik gibt es eine Option, mit der man sich die erfassten Trainingsdaten anzeigen lassen kann. Diese werden dann am unteren Rand über der Tabelle der Glukosewerte eingefügt. ","4887685844134622096":" Die Spalten auf der Profilseite wurden korrigiert, damit auch längere Zeitnamen (z.B. in spanisch) Platz finden. ","6192414002366785723":" Bei Tagesgrafiken und Wochengrafiken gibt es jetzt die Möglichkeit 1, 2, 4, 8 oder 16 Grafiken auf einer Seite zu platzieren. ","5086156331613866941":" Die Aufteilung auf mehrere PDF-Dateien funktioniert jetzt besser. ","2716217750823393157":"1.2.7 - 28.03.2019","4861197973031231700":" Wenn der Zeitraum leer ist, wird der Button für die Auswahl deutlich markiert und in dem Dialog zur Auswahl wird in der Titelzeile ein Hinweis darauf angezeigt. ","2458085471517281602":"1.2.6 - 27.03.2019","3355549227663925374":" Es ist jetzt möglich, die Wochentage festzulegen, die im Zeitraum berücksichtigt werden sollen. Die entsprechenden Tage werden bei der Auswahl des Zeitraums mit den Buttons unterhalb des Monats festgelegt. Auf den PDFs werden Zeiträume dann zusätzlich mit der Information versehen, welche Wochentage berücksichtigt werden, wenn es nicht alle sind. ","8146993522866256440":" Die Skalen an den Grafiken wurden überarbeitet. Sie zeigen jetzt für mmol/L ganzzahlige Werte an und die Einheiten wurden entfernt. Diese stehen nur noch unten an der Grafik. Das betrifft die täglichen Grafiken, wöchentlichen Grafiken und das Glukose Percentil Diagramm. ","5536760789265139434":"1.2.5 - 25.03.2019","2704758718840952536":" Wenn das erzeugte PDF zu gross wird, wird es nun auf mehrere PDF-Dateien aufgeteilt. In diesem Fall wird es nicht direkt geöffnet, sondern es wird eine Liste mit durchnummerierten Buttons angezeigt. Diese Buttons öffnen bei Betätigung das entsprechende PDF und erhalten einen Haken, um anzuzeigen, dass es geöffnet wurde. Das sollte es erleichtern, die PDFs nacheinander zu öffnen, weil normalerweise der Browser im Hintergrund verschwindet, wenn ein neues Fenster aufgemacht wird. ","5827392287548842147":" In den Einstellungen gibt es einen Regler, der festlegt, wie gross die erzeugten PDF-Dateien maximal sein dürfen. Wenn nur ein leeres PDF erzeugt wird, dann sollte dieser Regler weiter nach links geschoben werden, um die Dateigrösse zu verringern. ","2256302951336884805":" In der Tagesgrafik kann die Anzeige der SMB nun ausgeblendet werden. ","7642863960408671309":" Die Reihenfolge der Formulare kann nun verändert werden. Dazu einfach das Handle auf der linken Seite des Buttons für das Formular anklicken, festhalten und an die Stelle ziehen, vor der es ausgedruckt werden soll. ","8185302050418503852":" Auf der Analyseseite werden nun auch GVI und PGS ausgegeben. ","2143641972973300763":" Auf der Analyseseite kann statt der Anzahl der Werte bei den Zielbereichen jetzt die Standardabweichung der Werte im Zielbereich angezeigt werden. ","7272790870994895850":" Auf der Analyseseite wird jetzt auch die Standardabweichung aller Werte der Periode angezeigt. ","3688296022209187086":" In der Tagesgrafik gibt es eine Option, mit dem man die verschiedenen Arten der Boli kenntlich machen lassen kann. Wenn diese Option gesetzt ist, wird ein Bolus, der zu einer Mahlzeit abgegeben wurde mit einer anderen Farbe markiert, als ein Bolus zur Korrektur. In der Legende werden dann Korrektur-, Mahlzeiten-Boli und SMB getrennt angezeigt. ","966584332394053618":" Nightscout Reporter ist nun auch grösstenteils in Spanisch und Polnisch verfügbar. Entsprechende Buttons wurden dem Hauptmenü hinzugefügt. Danke an die fleissigen Übersetzer :). ","2234452339074400732":" Das Control für die Eingabe des Zeitraums wurde angepasst, damit es auf schmalen Display auch korrekt dargestellt wird. ","7061748368653638533":" Die Genauigkeit der Insulindosierung wird aus dem Profil ermittelt. Der Wert mit der höchsten Genauigkeit legt fest, mit wieviel Nachkommastellen Basalratenwerte angezeigt werden. ","153703985810725237":" Daten verschiedener Uploader werden nun besser interpretiert. ","3644990210412419679":" Daten, die von xDrip als sync markiert wurden, werden bei der Auswertung ignoriert. ","6783684155282109561":" Die Farben für Dialoge und Scrollbars wurden angepasst. ","8834231978593785875":" Die Berechnung der tatsächlichen Basalrate wurde korrigiert. ","4719973064533856377":" Die Profilseite wurde angepasst, damit Einträge für 24 Stunden auf eine Seite passen. ","8613883889694144083":" Die Links zu Nightscout und den Reports von Nightscout im Menü funktionieren jetzt auch richtig, wenn ein Usertoken angegeben wurde. ","831829680471616146":" In Firefox ist es jetzt auch möglich, die Hauptseite zu scrollen, wenn sie länger ist, als das Browserfenster. ","8565611804705215014":" Blutwerte werden jetzt auch bei mmol/L in den Grafiken korrekt angezeigt. ","4219373503238737879":" Die Standardabweichung wird jetzt auch bei mmol/L korrekt angezeigt. ","2405436612321185531":" Die fehlerhafte Zentrierung der Auswahlbuttons wurde korrigiert. ","3627345158565997852":"1.2.4 - 12.02.2019","7502718767982561417":" Es gibt jetzt auch die Möglichkeit, Nightscout Reporter in europäischem Englisch darzustellen. Der Unterschied zum amerikanischen Englisch besteht derzeit lediglich im Datumsformat (gb: dd/MM/yyyy, us: MM/dd/yyyy). ","1684033159361694926":" In der Legende unter der Tagesgrafik wird die Summe der Kohlenhydrate für den Tag angezeigt. ","3704660095733392644":" In der Tagesgrafik werden nun auch Reservoirwechsel angezeigt. ","7115971026305503232":" In der Tagesgrafik werden nun der geschätzte HbA1C und die prozentuale Menge an Bolusinsulin und Basalinsulin für den Tag angezeigt. Diese Anzeige erfolgt innerhalb der Legende, weshalb diese aktiviert sein muss, damit die Werte angezeigt werden. ","7081541250790132531":" Die Angabe DIA auf der Profilseite wird nun mit zwei Nachkommastellen angezeigt. ","6214726337468167755":" Für die Tagesgrafik gibt es jetzt eine Option, um die Aufsummierung nahe beieinander liegender Werte umzuschalten. ","6786503488477302998":" Die Kohlenhydratangaben auf der Tagesgrafik werden jetzt ohne den Zusatz KH ausgegeben. ","2696279668736247520":" Die Balken für das Bolusinsulin in der Tagesgrafik werden nun entsprechend dem Maximalwert an Bolusinsulin an dem Tag skaliert. ","6990358926812955547":" In der Analyse können die Prozentzahlen für die Zielbereiche mit Nachkommazahl angezeigt werden. Das verringert die Differenz zu 100%, wenn man sie zusammenzählt. Der verbleibende Rest sind Rundungsdifferenzen. ","3298417815236485312":"1.2.3 - 04.02.2019","2060321923731505088":" In der Tagesgraphic werden jetzt Insulinwerte und Kohlenhydratwerte zusammengefasst, wenn es mehrere innerhalb einer Stunde gibt. Die Balken werden nach wie vor für jeden Wert einzeln ausgegeben. Auf diese Art sollte es keine überlappende Ausgabe der Werte mehr geben. Die zusammengefassten Werte werden in eckigen Klammern ausgegeben, um anzuzeigen, dass hier Werte aufsummiert wurden. ","902981764014355414":" Der Fehler im Profil, der dazu führte, dass die Werte für ISF und Zielbereich falsch umgerechnet werden, wurde behoben. ","6816436606199457249":" Die fehlerhafte Platzierug der blutigen Werte bei mmol/L in der Tagesgrafik wurde korrigiert. ","4931003642421383514":"1.2.2 - 24.01.2019","987543708541980470":" Im Profil werden jetzt die richtigen Einheiten verwendet (mg/dL oder mmol/l). ","6771793203446501279":"1.2.1 - 22.01.2019","5877491119192060921":" Neue Option im Profil, um fortlaufende Zeiten mit gleichen Werten zu einem Eintrag zusammen zu fassen. ","6276112877929889283":" Wenn in einem Profil mehr Zeiten erfasst wurden, als auf eine Seite passen, wurden diese fortlaufend in die nächste Seite hineingeschrieben. Jetzt wird an geeigneter Stelle eine neue Seite ausgegeben. ","937733402985404723":"1.2.0 - 21.01.2019","5435845884171064606":" In der Tagesstatistik und in den täglichen Grafiken werden jetzt zum Datum die Wochentage mit angezeigt. ","8519038192433264278":" Neues PDF für eine Wochengrafik hinzugefügt, auf der die Glukosekurven der Woche übereinander gelegt werden. ","5473044180249684052":" Neuer Parameter für die Tagesgrafik, der festlegt, ob die Linien für die Notizen unter der Grafik bis zur Glukosekurve gezeichnet werden sollen oder nicht. ","2678033922423792303":" In der Auswertung können die Angaben für Material (Katheter, Sensor, Ampulle) mit Nachkommastellen angezeigt werden. ","3531288787928381694":" Die Berechnung des täglichen Insulins berücksichtigt nun auch die SMB. ","2354979441725982974":"1.1.2 - 08.01.2019","4615059425265416391":" In der Tagesgrafik werden jetzt auch Blutzuckermessungen angezeigt. Sie werden als rote Quadrate dargestellt und die zugehörigen Werte in der Tabelle unterhalb der Grafik werden ebenfalls mit roter Schrift angezeigt. ","7809573780420678903":" Die Microboli des Minimed 600 Uploaders werden jetzt auch ermittelt und in der Analyse ausgegeben, wenn sie vorhanden sind. ","383382329047888868":" Es gibt in den Einstellungen eine Option, das PDF herunterladen zu lassen, statt es im Browser direkt anzeigen zu lassen. Das wird für Browser wie Edge benötigt. ","4314556417043887900":" In der Tagesgrafik werden nun auch Kohlenhydratkorrekturen angezeigt. ","5078001255280902994":" Die Auswahl des Zeitraums ist nun flexibler. Die Auswahl erfolgt in einem Dialog, der die eingestellte Sprache berücksichtigt. Mit der Auswahl der vorbelegten Bereiche (Heute, Letzte Woche, usw.) wird festgelegt, dass beim nächsten Aufruf das aktuelle Datum als Grundlage für den Bereich verwendet wird. Wenn der Bereich direkt im Kalender festgelegt wird, dann gilt dieser beim nächsten Aufruf so wie er festgelegt wurde. Standardmässig ist der erste Tag der Woche jetzt ein Montag. Dieser kann aber durch Anklicken des Wochentags in der Titelzeile des Monats auf die eigene Präferenz festgelegt werden. Die Eingabe der Datumsfelder erfolgt in der Form, die der Sprache entspricht (Tag.Monat.Jahr für deutsch, Monat/Tag/Jahr für englisch). ","9170455987776194032":" Im Kalender-Control kann kein Datum nach dem aktuellen Tag mehr ausgewählt werden. ","5353771038969847315":" Im Kalender-Control wird jetzt der Monat des entsprechenden Datums angezeigt, wenn eines der Felder Von oder bis den Fokus erhält. ","126234916911088114":" Wenn in den Einträgen Lücken von 15 Minuten oder mehr sind, führen diese zu einer Unterbrechung der Linie in der Tagesgrafik. ","2655559394819682365":" Die Positionierung der Notizen in der Tagesgrafik wurde korrigiert, so dass sie näher an der Uhrzeit stehen. Die Striche wurden so verkürzt, dass sie nur noch bis zum unteren Rand der Grafik gehen und nicht mehr durch die Wertetabelle. ","7788136692440659939":" Die eigenen Grenzwerte auf der Analyseseite in mmol/L werden nun korrekt berechnet. ","3821944844445329552":" Ein Fehler wurde behoben, der dafür sorgte, dass die letzten Tage bestimmter Monate nicht im Kalender-Control angezeigt wurden. ","353974152985344566":" Ein Fehler wurde wahrscheinlich behoben, der dazu führt, dass bei manchen Profilen der Wert für DIA nicht korrekt ausgelesen wurde. ","838347286891196953":" Im Kalender-Control wird ein eingestellter Bereich (Heute, Letzte Woche, etc.) jetzt korrekt auf den aktuellen Tag bezogen. ","3788895486275509568":" Fehlerhafte Ausgabe der Blutzuckerwerte in der täglichen Grafik korrigiert. ","7646257712557304842":" Das Profil-PDF wird nun im Querformat erzeugt, um auch Profile mit vielen Einträgen für die Parameter brauchbar darstellen zu können. ","3402565124146215038":" Wenn Sonderzeichen in den Daten vorhanden sind (z.B. Smileys in den Notizen), führte das zu einem Absturz während der PDF-Erstellung. Das wurde behoben, indem diese Sonderzeichen aus der Ausgabe entfernt werden. ","7053837143494017662":"1.1.1 - 19.11.2018","2635733560322697283":" Tagesgrafikparameter zur Anzeige der Legende ","7018306980149626858":" Tagesgrafikparameter zur Anzeige von Notizen ","6207363723873361806":" PDF für Profildaten ","8556128241969826195":" Tagesgrafikparameter zur umgekehrten Sortierung hinzugefügt. Die Tage werden damit beginnend mit dem höchsten Datum ausgegeben. ","6040058982994125338":" In der Tagesgrafik wird jetzt eine Tabelle mit halbstündigen Glukosewerten eingeblendet angezeigt. Diese kann über einen Parameter ausgeschaltet werden. ","9127179894733336518":" In der Tagesstatistik wurde die Spalte Varianzkoeffizient hinzugefügt (VarK). ","8739263524610748752":" In der Tagesgrafik werden nun SMBs auch angezeigt, wenn die Option für die Darstellung von Insulin akitivert wurde. Man kann festlegen, ob die SMBs an der Glukosekurve oder am Zielwert angezeigt werden. ","5576109405009983748":" Die Berechnung der Summenzeile auf der Seite Tagesstatistik wurde korrigiert. ","8098937626003501590":"1.1.0 - 09.11.2018","4974232145976971100":" Zusätzliche Informationen zu den PDFs und im UI hinzugefügt ","1875321998396514171":" Summen für Bolus Insulin, Basalrate für den Tag und Basalrate aus dem Profil zur Tagesgrafik hinzugefügt ","8216826430516793510":" Einige Formulare können nun mit Parametern konfiguriert werden; hierzu den Pfeil am rechten Rand des Formularbuttons anklicken und im aufgeklappten Bereich die entsprechenden Einstellungen vornehmen; der Pfeil erscheint erst, wenn das Formular zum Ausdruck markiert wurde ","6718149088815928424":" Anzahl der Sensoren zur Analyse hinzugefügt ","4877549963229687416":"Die Möglichkeit für Beta-Funktionen wurde entfernt; die Betaversion ist nun hier zu finden: ","8509354342374801204":"https://nightscout-reporter.zreptil.de/beta","3610693111373688180":" Übersetzungen korrigiert ","2495668500243256985":" Titelangaben für Datumsbereiche auf den PDFs vereinheitlicht ","8362612761064619785":" Absturz behoben, der auftrat, wenn kein passendes Profil für einen Zeitpunkt gefunden werden konnte ","8061617683062696207":"1.0.4 - 28.10.2018","8127362636802439807":" Benutzer können nun gelöscht werden ","6149114938639663630":" Benutzer können ein User-Token angeben, um sich mit geschützten Nightscout-Instanzen zu verbinden ","8650960982858929363":" Kohlenhydrate und Bolusinsulin werden jetzt in den täglichen Grafiken angezeigt ","8709678271095591939":" Spalte HbA1c zu Tagesstatistik hinzugefügt ","3170136323214913820":" Bisher fehlende Summenwerte in der Tagesstatistik hinzugefügt ","3259043382915308937":" Spaltenbreite der Informationen in der Analyse erhöht ","583673701429643291":" Die Icons auf einigen Buttons waren zu nahe am Text ","1454723098678159880":" Temporäre Basalraten mit absoluten Werten werden korrekt dargestellt ","8538521964080966841":"1.0.3 - 26.10.2018","8067994182832959136":" Man kann jetzt mehrere Benutzer anlegen. Das ist nützlich, um mehrere Nightscout-Instanzen auszuwerten (z.B. für Ärzte, Betreuer oder den Entwickler dieser Software) ","4790504052391578723":" Benutzerdaten werden nun verschlüsselt im Browser gespeichert ","713972851255611070":" Die Analyse-Seite wurde überarbeitet und zeigt nun Überschriften über den Bereichen an ","138475367412508287":" Wenn die Grenzwerte in Nightscout (BG_TARGET_BOTTOM und BG_TARGET_TOP) den Werten 70 und 180 entsprechen, wird auf der Analyse-Seite der Bereich für die Standardzielwerte ausgeblendet ","1788573597494772974":" Die Tagesstatistik zeigt mmol/l-Werte nun korrekt an ","3980955818645149106":" Die Werte für den Standardzielbereich auf der Analyse-Seite werden nun korrekt ermittelt ","4582132530116788517":" Im PDF werden Zahlen und Datumsangaben entsprechend der ausgewählten Sprache formatiert ","1182725720134167848":" Beim Laden der Daten wird das entsprechende Datumsformat zur Anzeige verwendet ","2148000969131138048":" Fehlerhafte Messwerte werden in der Auswertung der Grafiken nicht mehr brücksichtigt; diese werden an dem Wert \"NONE\" im Datenfeld \"direction\" erkannt ","6389723268224285738":" Bei der Berechnung der Kohlenhydrate werden weitere Datensätze berücksichtigt ","8634556641208208863":" Diverse Abstürze beim Auslesen der Daten bereinigt ","3811197341601266289":" Die Möglichkeit, die URL in der Titelzeile anzeigen zu lassen wurde entfernt, da jetzt der aktuelle Benutzer oder dessen URL direkt angezeigt wird ","6508224121592610603":"1.0.2 - 23.10.2018","6835944543816063239":" Legende für Katheter- und Sensorwechsel zur Tagesgrafik hinzugefügt. ","9033696485048544720":" Reihenfolge der PDF Seiten geändert - Perzentil Diagramm kommt jetzt nach der Analyse. ","6122813462958960286":" Daten für die Glukosewerte mit fehlerhaftem Datumsformat werden jetzt trotzdem korrekt ausgelesen. ","2945313474986055872":" Hohe Basalraten werden jetzt besser dargestellt. ","4992435423643759924":"1.0.1 - 23.10.2018","8591655988411008895":" Diese Seite hinzugefügt. Sie wird jedesmal beim Start von Nightscout Reporter angezeigt, wenn sie in der aktuellen Version noch nicht angezeigt wurde. Ausserdem kann sie im Hamburgermenü wieder aufgerufen werden. ","2456123071794622816":" Schliessen Button im Nachrichtenbereich hinzugefügt. ","7406699057163800071":" Fehler werden besser abgefangen und mit sinnvollem Text ersetzt. ","4493611443892279985":" Das Anklicken des Nachrichtenbereichs schliesst diesen nicht mehr. ","67850694126559908":" Name, Geburtstag, Insulin und das Startdatum des Diabetes können nun leer gelassen werden, ohne dass das negative Auswirkungen auf die Darstellung im PDF hat. ","7632908809083441500":" Fehlermeldung beim Laden von Profilen ohne Startdatum entfernt. ","4441590616774887117":" Wenn keine Daten verfügbar sind, werden leere Seiten mit einem entsprechenden Hinweis erzeugt. ","7724059988272480953":" Die Glukosekurve der täglichen Grafiken wurde von fehlenden Daten befreit. ","6687579012216273417":" Das PDF für die Basalrate war nicht korrekt, wenn nicht für jede Stunde ein Wert vorlag. ","268090716037188771":"1.0.0 - 20.10.2018","5362544797046449925":" Initiale Version, alles ist neu! ","3253285846028235067":"{$START_TAG_DIV}Farbauswahl{$CLOSE_TAG_DIV}{$START_TAG_BUTTON}{$START_TAG_MAT_ICON}close{$CLOSE_TAG_MAT_ICON}{$CLOSE_TAG_BUTTON}","1502678440868604199":"Die Datei hat {$PH} Bytes, darf aber maximal {$PH_1} Bytes haben.","3050936642513294348":"Glukosewerte anpassen","_msgAdjustTarget":"Die Werte für BG_TARGET_BOTTOM und BG_TARGET_TOP wurden durch den Faktor {$PH} geteilt","_msgAdjustCalc":"Errechneter HbA1C: {$PH}%","_msgAdjustLab":"Im Labor ermittelter HbA1C: {$PH}%","6413617351871198124":"Ausgabe","2738344853196123783":"Grafik","544006034280571514":"Tabelle","2323440543726766760":"Alles","5151636223616140512":"Glukose Perzentil Diagramm","2711250160567783345":"GPD","3881770102020259507":"Stündliche Statistik","8203928250407677295":"Tagesbasalrate verwenden","2353356285650606192":"Grafiken pro Seite","4496863263131552292":"Temporäre Overrides","862810997454722107":"Ausrichtung","4825886895103641575":"Wechsel","4799738962969899274":"Tag (08:00 - 17:59)","8482316664535002400":"Dämmerung (06:00 - 07:59, 18:00 - 20:59)","2594762698141458563":"Nacht (21:00 - 05:59)","msgInsulinUnit":"IE","msgMedian":"Median","msgUntil":"bis","msgGlucosekurve":"Glukosekurve"," msgMealBolus":"bolus to handle a meal|:Mahlzeitenbolus","msgBolusWizard":"bolus calculated by the bolus wizard|:Bolus Rechner","msgBolusExtInsulin":"Verzögerter Bolus","2219368439683381667":"Basalrate","749625153693614079":"TDD","4076382777671752130":"Es sind keine Daten für den Ausdruck vorhanden","4454748570434478881":"Katheterwechsel","8346899012697432624":"Sensorwechsel","7046574872074290826":"Reservoirwechsel","8455752117784953913":"Aufsummierte Werte","5384898210620182184":"Berechnete IE für Kohlenhydrate","5704746599911012534":"KH","5827116118592472242":"Ausgewertete Tage","1835952148608981798":"Anzahl Messungen","1050378413846699180":"Anzahl Ampullenwechsel","1372288784830026329":"Anzahl Katheterwechsel","7355001655062739838":"Anzahl Sensorenwechsel","8509885123077207041":"gesch. HbA1c","1827304388834236660":"Geschätzter HbA1c","91599463657009748":"Niedrigster Wert im Zeitraum","2310845179337180115":"Höchster Wert im Zeitraum","3108179215936124659":"Ø Zuckerwert","5457473337498968322":"Glykämischer Variabilitäts Index (GVI)","2560018446621143068":"Patient Glykämischer Status (PGS)","4285342514168660953":"Ø KH pro Tag","2695192575116129638":"Ø KH pro Mahlzeit","3643936595511867160":"Ø Insulin pro Tag","1987555743730291808":"Ø Bolus pro Tag","5777511888156505900":"Ø Basal pro Tag","461810520483495155":"Ø Microbolus pro Tag","8106907906617014665":"Ø Insulinverhältnis","4465176480961650842":"Bolus","5456331975294648312":"Basal","4370541832116997140":"Basalrate\nIE / Stunde","5332830754562778560":"Keine","3844704342810498163":"Eigene Grenzwerte","417194596190787156":"Standardgrenzwerte","8735196119108420705":"Behandlungen","8579240404470114859":"Zeitraum","8665839107223122205":"Ges.","5716956580689550728":"Uhr-\nzeit","5090553636000273831":"IE/std","6941480264920362873":"Summe","7079029906993509129":"Trend","6520529921725441580":"Notiz","7814380740217085349":"Anpas-\nsung","3991336875625498115":"Glukose zu niedrig","5989584839847863549":"Glukose im Zielbereich","3288838619245936394":"Quelle: Vigersky, R. A., Shin, J., Jiang, B., Siegmund, T., McMahon, C., & Thomas, A. (2018). The Comprehensive Glucose Pentagon: A Glucose-Centric Composite Metric for Assessing Glycemic Control in Persons With Diabetes. Journal of Diabetes Science and Technology, 12(1), 114–123. (https://doi.org/10.1177/1932296817718561)","1997128442622489168":"Glukose zu hoch","3080483882937310852":"Normal","1944749227875658217":"10% - 90% der Werte","4040392642686639683":"25% - 75% der Werte","8403380952577227473":"Insulin Kohlenhydrate Verhältnis (ICR)","1285090408683202139":"Insulin Sensitivitäts Faktoren (ISF)","1933013871016789910":"Gesamt","3846842741887786114":"Zielbereich","6633861517381811980":"Ø ICR/Stunde","7614103255736405267":"Ø ISF/Stunde","4091766776237352490":"Insulin Kohlenhydrate Verhältnis (ICR)\nX g Kohlenhydrate für 1 IE","190462900005986981":"Profileinstellungen","6838298781579903570":"Dauer der Insulinaktivität (DIA)","8281622806981246575":"Stunden","5653192105985208694":"Dauer der Kohlenhydrataktivität","7508842946929094457":"Zeitzone","8565690938370306884":"g / Stunde","8198237091765701133":"Verteilung","6054305971182360492":"Mess-\nwerte","4912803901980915876":"Min","3667949571823271511":"Max","2245223703355813532":"IE","954997609648411319":"Mittel-\nwert","7612401945163585274":"Std.\nAbw.","3085022192590638473":"VarK\nin %","114014997560884624":"10%","410694998387368400":"25%","8486829037533787324":"75%","9145809862065332211":"90%","5030829345161940560":"Durchschnitt","6993938051305400866":"Standardabweichung","2633729073167909034":"{$PH} Uhr","194157074469443413":"{$PH} am","7975293901451211912":"{$PH} pm","658509511596516220":"Kalibrierung (scale {$PH} / intercept {$PH_1} / slope {$PH_2})","6901562133099764608":"1 Seite oder mehr","1149582344080641990":"{$PH} Seiten oder mehr","6506885859968423722":"1 Seite","1857951656960027099":"{$PH} Seiten","msgKW":"KW{$PH}","msgValidRange":"gültig von {$PH} bis {$PH_1}","msgValidFrom":"gültig ab {$PH}","msgValidTo":"gültig bis {$PH}","msgDuration":"{$PH} Std {$PH_1} Min","msgTargetArea":"Zielbereich ({$PH} - {$PH_1}{$PH_2})","msgTargetValue":"Zielwert","_msgLowerGlucHint":"Alle sensorischen Glukosewerte wurden um {$PH} % verringert","_msgRaiseGlucHint":"Alle sensorischen Glukosewerte wurden um {$PH} % erhöht","msgCarbs":"Kohlenhydrate ({$PH}g)","msgBolusInsulin":"Bolus Insulin ({$PH})","msgCorrectBolusInsulin":"Korrektur Bolus ({$PH})","2630105366061918724":"Mahlzeiten Bolus ({$PH})","6548316943536498969":"SMB ({$PH})","3909704910396085444":"Basalrate für den Tag ({$PH})","4286587832391329338":"Basalrate aus dem Profil ({$PH})","5570859919727012443":"Gesamtinsulin ({$PH})","5078435853672992591":"{$PH}g","310135135909995723":"Keine Messwerte vorhanden","4642711167787568908":"1 Messung am Tag","9100627874396355833":"{$PH} Messungen am Tag","5046449995628369445":"1 Messung pro Stunde","2690513100444212741":"{$PH} Messungen pro Stunde","7131139370526216674":"1 Messung pro Minute","8334446718946772191":"Messung alle {$PH} Minuten","4341500156747589894":"Werte zwischen {$PH} und {$PH_1}","7258244579318280186":"Werte unter {$PH}","1561702909227178336":"Werte über {$PH}","3146896021015651634":"Sehr hohe Werte ( > {$PH})","5643627311954309822":"Hohe Werte ({$PH})","5281244940059566908":"Zielbereich ({$PH} - {$PH_1})","6356747117170967509":"Niedrige Werte ({$PH})","8465282339211094633":"'Sehr niedrige Werte (< {$PH})","7032229894851079271":"g KH ({$PH} BE)","1479891049004238768":"({$PH} Tag pro Ampulle)","5947608586796983691":"({$PH} Tage pro Ampulle)","4127636796372029708":"({$PH} Tag pro Katheter)","6739967434924345460":"({$PH} Tage pro Katheter)","5306121135087520090":"({$PH} Tag pro Sensor)","5615330300156559861":"({$PH} Tage pro Sensor)","1382429000553069395":"Tief{$PH}","5351459095868569938":"Kein Wert","7070333232316529621":"1 Wert","4834711968050618724":"{$PH} Werte","6842756027191066886":"(StdAbw {$PH})","6573896715468220408":"Hoch{$PH}","2819034921980842641":"Insulin Sensitivitäts Faktoren (ISF)\n1 IE senkt BG um X {$PH}","4415704711981908542":"Glukose-Zielbereich{$PH}","8436223332064456837":"{$PH} - {$PH_1}","3499176050291189451":"{$PH} Tage","3960347178741939388":"nicht vorhanden (kleiner {$PH})","4039828375117343729":"sehr gut ({$PH} bis {$PH_1})","8014171383833842560":"gut ({$PH} bis {$PH_1})","2186320724771371544":"schlecht (grösser {$PH})","3049594061037724196":"exzellent (kleiner {$PH})","7127621015227459339":"schlecht ({$PH} bis {$PH_1})","9038529253462906018":"sehr schlecht (grösser {$PH})","151955983675362130":"Historisch {$PH}","1935073897932930018":"Eine Spalte abwählen, um eine@nl@andere aktivieren zu können","3334517318339819734":"Noch eine Spalte verfügbar","2476631956251729930":"Noch {$PH} Spalten verfügbar","help-analysis":"\n  Dieses Formular zeigt die Auswertung der Werte des ausgewählten\n  Zeitraums. Dabei wird auch der durchscnittliche Verbrauch an Materialien\n  rechnerisch ermittelt und angezeigt. Dieses Formular beinhaltet die meisten\n  Informationen, die Diabetologen gerne wissen wollen.\n\n  Der HbA1c wird rechnerisch aus den vorhandenen Daten ermittelt und weicht\n  normalerweise nicht unerheblich von dem tatsächlich gemessenen Wert ab. Der\n  Wert, der aus der Blutprobe ermittelt wird, gibt die tatsächliche Bindung\n  von Glukose im Blut wieder. Da diese von zusätzlichen Faktoren abhängig ist\n  und nicht nur von den hier verwendeten Messdaten, ergeben sich Unterschiede\n  zum errechneten Wert. Vor allem, wenn es sich bei den gemessenen Werten nicht\n  um Blutzucker, sondern um Gewebszucker handelt, wie er von CGM-Systemen\n  verwendet wird.\n\n  Trotzdem ist dieser Wert ein grober Anhaltspunkt für die Qualität der\n  Glukoseeinstellung und wird in der vom Labor ermittelten Form gerne von\n  Diabetologen als Richtwert verwendet, weshalb er hier angezeigt wird. Er wird\n  aber in schwächerer Schrift ausgegeben, damit seine zweifelhafte Natur auch\n  erkennbar ist.","7363002699976597223":"Material mit Nachkommastellen","8929073393912765795":"Zielbereich mit Nachkommastellen","8185760820581470336":"Standardabweichung statt Anzahl","7243366343051576498":"Standardbereich mit feinerer Abstufung","3685523307465774723":"Unterzuckerungen anzeigen","8015856771643324012":"Auswertung","1635224838673040426":"Anzahl Unterzuckerungen","5592651710859283027":"Letzte Unterzuckerung","4324982987263927268":"Unterzuckerungen (< {$PH})"}}]